index=* sourcetype=cowrie
eventid="cowrie.login.success"
(
  (username="root" AND password="toor") OR
  (username="admin" AND password="admin")
)
| table timestamp src_ip username password session protocol
| sort timestamp
